# 1) დარეგისტრირდით GitHub ზე  და შექმენით რეპოზიტორი/საცავი, ატვირთეთ პირველი დავალების ფაილი რეპოზიტორიში

# 2)  შექმენით ფაილი სახელად Assignment2.py რომელშიც დაწერთ დღევანდელ დავალებას

# 3) მომხმარებლის მონაცემების მიღება (input):

# 	პროგრამამ უნდა სთხოვოს მომხმარებელს შეიყვანოს თავისი სახელი და გვარი (ცალ-ცალკე ცვლადებში).
# 	სთხოვოს დაბადების წელი.
# 	სთხოვოს საყვარელი პროგრამირების ენა.

user_name= input("თქვენი სახელი? \n")
user_surname= input("თქვენი გვარ? \n")
user_age = input("თქვენი დაბადების წელი? \n")
user_info = input("საყვარელი პროგრამირების ენა? \n")


# 4) მონაცემების დამუშავება და ფორმატირება:
	
# 	სახელი და გვარი გადაიყვანეთ დიდ ასოებში.
# 	გამოიანგარიშეთ მომხმარებლის ასაკი მიმდინარე წლის (2026) გამოყენებით.
# 	შეამოწმეთ და დაბეჭდეთ ლოგიკური (boolean) შედეგი: არის თუ არა მომხმარებელი სრულწლოვანი, ანუ მისი ასაკი მეტი ან ტოლი 18-ზე (>= 18).
# 	დაბეჭდეთ მომხმარებლის ინფორმაცია(სახელი, გვარი, ასაკი, საყვარელი ენა, არის თუ არა სრულწლოვანი) ლამაზად სეპარატორით - '|'
# 	მაგალითად: SABA | ANANIDZE | 2000 | PYTHON | True

now = 2026

user_age_info = now - int(user_age)

print(user_name.upper(), user_surname.upper(), user_age, user_info, user_age_info , user_age_info >=18, sep=" | ")

# 5) "სკოლის შემაჯამებელი სამუშაო" - 20 ქულიანი ტესტი
	
	# მოითხოვეთ მოსწავლის მიერ მიღებული ქულა (მაქსიმუმ 20 ქულა), ინფუთშივე დაწერეთ რომ მაქსიმუმ 20 ქულა უნდა იყოს.
	# შემდეგ ამ 20 ქულისგან სკალირება მოახდინეთ რომ დაუწეროთ ნიშანი 10 ბალიანი სისტემით.
	# მაგალითად თუ მოსწავლე მიიღებს 18 ქულას, უნდა მიიღოს 9იანი, თუ 15 ქულას უნდა მიიღოს 7იანი. მონაცემებს არ ვამრგვალებთ ზევით, 7.5 ქულას ვწერთ როგორც 7იანს.
	# მინიშნება: გამოიყენეთ '//'

user_grade = input("შემოიყვანეთ თქვენი მიღებული ქულა (მაქსიმუმ 20 ქულა) \n")

grade = int(user_grade) // 2

print("მოსწავლის ნიშანია:", grade)

# 6) ფაილი ატვირთეთ გითჰაბის რეპოზიტორიში.