#3)დაბეჭდეთ თქვენი სახელი, გვარი ერთ ხაზზე ისე, რომ მათ შორის დაშორება იყოს ორი სფეისი მაგ:გიორგი  გიორგაძე, 
#სფეისები არ უნდა იყოს ("" /'')- ებს შიგნით!

print("ილია", end="  ")
print("გაფრინდაშვილი")

#4)შემდეგ ხაზზე დაბეჭდეთ რიცხვები ერთიდან ათის ჩათვლით, სეპარატორით "+" და ერთი ხაზის გამოტოვებით 
#დაბეჭდეთ მათი ჯამის მნიშვნელობა. "=55"

print("1","2","3","4","5","6","7","8","9","10", sep="+", end="\n\n")
print("=55",end="\n\n\n")

#5)ორი ხაზის გამოტოვებით დაბეჭდეთ "ოპერაცია დასრულებულია"

print("ოპერაცია დასრულებულია")